% =========================================================================
%                          Written by Yi Qin and Xin Wang
% =========================================================================
% 子函数——ReLU的导数（此处的ReLU实际上是LReLU，即其负数部分有小斜率）
function  X = dev_hexpo(A,nn)


a = 1;
b = 1;
c = 1;
d = 1;

a = 10;
b = 10;
c = 1;
d = 20;

X=zeros(size(A));       % 与A同样size的矩阵，用于存储计算得到的矩阵 


% 大于等于0的部分
idx    = find(A>=0);    % A中大于0的元素的坐标（该坐标按照从上到下，从左到右的顺序依次检索）
temp = exp(-A / b);
X(idx) = a/b * (temp(idx));             % 对这一部分直接将导数赋值为1

% 小于0的部分
idx    = find(A<0);     % 对净输入值小于0的这部分，将其到导数直接赋值为0.01
temp = exp(A / d);
X(idx) = c/d * temp(idx);

